# vstGetInitObject

## Description
Return HANDLE to the object that this tool should copy. Part of 'similar object createion'. Used inside ToolInitByObjectMessage::kAction event.

```pascal
FUNCTION vstGetInitObject(message1 : LONGINT) : HANDLE;
```

```python

def vs.vstGetInitObject(message1):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message1|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events